#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-xhvwL1jTt6mPqGvy

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_instance.composer_internal: Refreshing state... [id=i-03a9bf86f1172bd06]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-058038b85675d1cd3]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-1005946728]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-bfbe1993-77ed-4a7d-a60e-6ee2ba32da70]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-2938156035]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-f88d8983-0018-4222-923a-bf6a1726d56d]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.external_cloudwatch_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "external_cloudwatch_logging"  {
      ~ id      = "2890200136" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "BasicCloudWatchUsage"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:933752197999:log-group:external_composer_staging:log-stream:external_composer_syslog",
                          - "arn:aws:logs:us-east-1:933752197999:log-group:external_composer_staging",
                        ]
                      - Sid      = "CloudWatchSendLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:logs:us-east-1:933752197999:log-group:external_composer_staging",
              - "arn:aws:logs:us-east-1:933752197999:log-group:external_composer_staging:log-stream:external_composer_syslog",
              ~ (known after apply),
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.internal_cloudwatch_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "internal_cloudwatch_logging"  {
      ~ id      = "1934734914" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "BasicCloudWatchUsage"
                    },
                  - {
                      - Action   = "logs:PutLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging:log-stream:internal_composer_syslog"
                      - Sid      = "CloudWatchPutLogEvents"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging:log-stream:"
                      - Sid      = "CloudWatchDescribeLogStreams"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging:log-stream:internal_composer_syslog",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging:log-stream:",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "1522816321" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs94z3BOIakWDK4iuiqrWZYWOK+mhb+JSFBN89VHzna3ayim+Sw8iFVJqDbrVUG40LgTY6QYL6Y5fhkpnvnSNvRnmNMnuCueCoxyzIoEUrjC+dOm4DAsGCc8tSTpoSEKrYdWq3WhevJzvDs1rtyDamNMLvJNWzY7xmBqDSb6i9bW271LzWvr3X9cWbHxC5RHWdnicxcWDqVJAmnAxTOPpK2rfs+0FO2End7WlJepoaiD+fMFPe4KJ7dL8/jSjN8A1x0YzzXMUO0CLndF+ypd6RiKZb4dTNG708lAt15sY/wcMpYVT7Xa+5NV305WhQk8phTuivISa7dNyPdUfrNQZWlCvt+b/DlO19F/XD4gIekOBy9BmsCIFuAZ/BncMQyTW5e5+zdwF278anmNH9fP2Hy7Ba4aEATP4O77ViPIoZxVM1w2XRfrzgL/bvv+aXZ8QDpJacRy9H0ofwRauQ3Og9wmh6XPgWWag0ECVxjIpRqcg4iCtmtW37i6KSqewNUHkpOO0z2fftWCFG3KofQk7rxWDVlCKm8COiFGMcBbnB+AxIMCo5QGBYA0ACRdAZaC4lCQdHVVWWAGAoiTlAKJv1kric+UX2W3S8gBRAgXBdhGsBxAAdtQislJMMaAhRgk15MXKcG3espjBSBLcwbER0Esjbrsln+bAgMYBHkpnKQIkjAt2M0+PGsPkog+nVR8NczBebQ8ABZCBnb4pxwDmjKAIYvoquQ7m4WTND+AlJ6+IlowSNGbfZ2+0hld4h7cl4H/pjpaXnk3RXl3P4OHxr/eGFbeagOgAyK4uFlmIaYA7zECtU2R105HqvkRrWXpMc39lL1AgvObUyi02ORnCPM0Zad3h+JQMJyAqKA/MbDcEPLeXnUwVi42n1imbasPareWFxlE+M3wR/5bw1mUvLN7F7EwokD4Zxzp7I0X34iWYIcBghTkGKIQoIBWvw5XX2NAn1jK75IQHgJMf/8EXAx2ESEAkh08FGCFGYCgzksgxDkGPkaw9Jx0CRCJMGUA4ZwV72EqrxPkISYvKKDAHVh9cCluH4y4RW4JI4JvHTSL6OofAONXRZaxUK9Lt0t5ylKUknMSuNkoGGSbMs/VeenDdYGiICA91bUCfAaddjndDdRBp20ppYtcMlYeFkkNwdr5vNwGZ2ViA1/+oUO95cK/evhvk+O/nEh9WIRvl25iGoATT1H6y1VM9X0+/akAmG6jPKVlFgRbmEfQJ7gAMMfgmhxxcHKNpzfWvzud/qjozsCY6JqiW1dnntmKrbyr0K8bvMEfyvFt21GLylTP+edUz12PxF26iItcTTHNdk95vvuf//rP/wb32kQfWC/ltG2d4vOyYCqGM+goZfa6rJx8GrLrZ7dtKdfHEEMx7bH1fP87uCtA8VqAAtOAS3BxygIcdzKc2+QE3L+dCnBXAs5PgwO4u78Ydvf7i1SMwhTcn2VXKvmGoiQ4v4GgMEkD8Gn/N/jMmZR/4PmPRZQD51yHGAGYlrcKOI6mu3M5+ZV327/nBXbPFSEm5NwF/tIT7I13llWLw5sUZFGGy+itFOkmR/j7Dz6VH0EPs3flBQy61cpAN6223lFeBt3n+9+hEnhuXJzc8qlWE5qtqtioVy//1ghkuGC1BDPIBZDB2lUWFwW/L3W0iwInJT5lgaQwwdWKao/Hb93q89395+83sF+4+883xny5K8VN84gykG7OhlO8u5F7uvM7E7NTJb0Uo+t2Gaf3n9+p/lI9iTQvKHxgqFauv8pLLjDj3kTdvxPz27jtCzjnocIvAXq7dZYCo6+fwTDwKioYzt/7xSltlzSVD0Fzitl3vX9Z8rjzEreFZIPBv5fxwmEaZGlE2TmSP//aVPHlwnKREgUl/V+Zsb6Av4D1K+BycFc1T3wmyyO6ugM/nwG5HadeLra+XMap6rpIaeXK/muUd3+jMPAXcLqkPAHc8m81oPK9ke/ynzuA4+CGpb8lX+vijKQHUM7Lp+JwHm2Ks59dNksvu44voNM+tUPRMkKQ4WrFhwVu1gEXAA788Y9/BPefPzwJfwE/g/vPt5Psl5sZ6JfUxPhwmjDe6fr/8uvvvE38VVc+A3l6iHjvuV837r5PeXbLN1C/Re/MwMX4cELwg2CUs/+j4OvV3MTFN6f57bn4qTkoq8N3HL2sLpvshqTyI7Am3cn7mYFiHJR5GKV0i/OyHkWnzrKrm6AssTnYlb3uDgMCNxSF1QqC7BQUdzdIX8aEL7fol1Xqyx34+edbE35DEF/L+Sa74AoKnG8jhC/4TnOclf30x8eQnwqQ4yRl+CPbKfaLFMW4HLx+oY27SjuLuLyc/ekjrE+PDzz/DZgc90PlfwMAAP//ORGkuwMgAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=external.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "4194052785" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs8RZTinkFQLBlcRXZXVLEsLnFfTwt9EJKim+eojZ7vbNRTTfBb4qsRXhceqIFxI3IkxUowX0xy/jBTPfGkb+jPM6RPcFU8FRjlmRQIpXOH8aVNwGBaME55akvTQEIXWQ6vVulA9+TnenfpW7kG1MSYX+aYtmx1jMLUGE/1Fa+vt3qXktfXuP66s2PgFyqOs7PC5CwuH0iSBNODimUfS1lW/Z1qKdoJOb2vKy9RQ1MH8+QIed0WT26V5fOnFb3DrDoznGmaodsGWu4J9la50DMUy3w6m6N3pZKBbL7Yxfg4Zy4qnWm2bIczxgSAJjbrENxv1li+ggGsd9/nDsbGtvj959e3k1ZKxChN4TCncFeVF124ble/Z9c1ClaUJ+X7/8uc4XUf/cfmAhKQ7HLwEaQIjWoBn8GdwxzBMbt3q7t/AXbjxq+Vdf1w/A/jtFrhqQBA8g7vvW40gh3JWzXDZmF2sOwv8u+37p9nxAekkpRHL0feh/BFo5TY4D3ubHJaOCZZpDgYJXGEgl2pwDiIK2q5ZfePqpqh4AldHSU46Tvd8+lULUrQpB9eTuPNaNWQJqbwJ6IQYxQBvcX4AEg8KjFIaFADSAJB0BVgKikNB0tVVZYEZCCBOUgok/matJD5TfpXdLiEHECFcFGAbwXJIBWxDKSYnwRgDFmKQXE9epATf6imPFYAszRkQHwWxNOqyW/5tCgxgEOSlcJIiSMK0YDf78Kw9SCL6dFLx1TAH59HyAFgIGdjhn3IMaMoAhiyiq5LvbBZO0vwAUnr6imjBIEVv9nX6Smd0SQ7gvswOb6qj5ZV3U5R39zN4aPzrjWHlrTYAOiCCi5tlFmIK8B4jUNsUee10pJof0VqWHtPcT9kLJDi/OYVCi01+hjBPU3Z6mygOBcMJiAr6EwPLDSHv7VUHY+Vi84ll2rb6oHZreZFBhN8Mf+S/NZxFyTu7dxELIwqEf8aRzt548Y1oCXYYIEhBjiEKAQpo9esA9jUG9Iml/C4J4SHA9PdPwMVgFxECINnBQwFWmAEI6rwEQpxj4GMES89JlwCRCFMGEM5Z8R6m8jpBHmLyggIK3IHVB5cC+MGIW+SWMCL41kGziK7+ATB+VWQZC/W6dLuUpyxFKTkngZuNgkG2KfNcnZc+XBcoCgLSU/ErwGfQaZcT4EAddNqWUrrIJWPlYZHUEKydz8ttcFYmNvDlHzrUWy78q4f/Njn+y4nUh0X4dukmpgE48RSlv1zFVN/n058KgOk2ylNaZkGwhXkEfYILAHMMrskRByfXeHpj/bvT6Y+K7gyMia4punV15pmt2Mq7Mv66wZuP5fi2N6lFZarn/HOq565H4i6txkWupphmu6c83/3Pf/3nf4N7baIPrJdyIrdO8XlZMBXDGXSUMntdVk4+Ddn1s9u2lOuDiaGY9th6vv8d3BWgeC1AgWnAJbg4ZQGOOxnObXIC7t9OBbgrAeenwQHc3V8Mu/v9RSpGYQruz7IrlXxDURKc30lQmKQB+LT/G3zmTMo/8PzHIsqBc65DjABMy1sFHEfT3bmc/Mrb7t/zSrvnihATcm4Vf+mZ9sY7y6rF4U0KsijDZfRWinSTI/z9R6HKj6CH2bvyAgbdamWgm1Zb7ygvg+7z/e9QCTw3Lk5u+VSrCc1WVWzUq5d/awQyXLBaghnkAshg7SqLi4LflzraRYGTEp+yQFKY4GpFtcfjt5b2+e7+8/e73C/c/ecbY77cleKmeUQZSDdnwyne3cg93fmdidmpkl6K0XW7jNP7z+9Uf6meRJoXFD4wVCvXX+UlF5hxb6Lu34n5bdz2BZzz5OGXAL3dOkuB0dfPYBh4FRUM5+/94pS2S5rKh6A5xey7AaAsedx5idtCssHg38t44TANsjSi7BzJn39t9PhyYblIiYKS/q8MYl/AX8D6FXA5uKuaJz6T5RFd3YGfz4DczlwvF1tfLjNXdV2ktHJl/zXKu79RGPgLOF1SngBu+bcaUPneXHj5DyDAcXDD0t+Sr3VxRtIDKIfqU3E4jzbF2c8um6WXXccX0Gmf2qFoGSHIcLXiwwI364ALAAf++Mc/gvvPH56Nv4Cfwf3n23H3y80M9EtqYnw4TRjvdP1/+fV3HjD+qiufgTy9Vrz33K8bd9+nPLvlG6jfondm4GJ8OCH4QTDK2f9R8PVqbuLim9P89lz81ByU1eE7jl5Wl012Q1L5EViT7uT9zEAxDso8jFK6xXlZj6JTZ9nVTVCW2Bzsyl53hwGBG4rCagVBdgqKuxukL2PCl1v0yyr15Q78/POtCb8hiK/lfJNdcAUFzrcRwhd8pznOyn7642PITwXIcZIy/JHtFPtFimJcDl6/0MZdpZ1FXJ7X/vQR1qfHB57/BkyO+6HyvwEAAP//us6ReicgAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=internal.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "9d8595a41ed865a60abfd98d3c84876b2d95135b17c827aca42e935f6dbecdb1" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=external.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit
        EOT -> (known after apply)
      ~ template = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=${osbuild_commit}
                  COMPOSER_COMMIT=${composer_commit}
                  OSBUILD_CA_CERT=${osbuild_ca_cert}
                  COMPOSER_HOST=${composer_host}
                  COMPOSER_ADDRESS=${composer_address}
                  WORKER_SSL_KEYS_ARN=${worker_ssl_keys_arn}
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=${subscription_manager_command}
                  SYSTEM_HOSTNAME_PREFIX=${system_hostname_prefix}
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://${secrets_manager_endpoint_domain}/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
          +   - path: /etc/vector/vector.toml
          +     content: |
          +       [sources.journald]
          +       type = "journald"
          +       exclude_units = ["vector.service"]
          + 
          +       [sinks.out]
          +       type = "aws_cloudwatch_logs"
          +       inputs = [ "journald" ]
          +       endpoint = "https://${cloudwatch_logs_endpoint_domain}/"
          +       group_name = "${cloudwatch_log_group}"
          +       stream_name = "worker_syslog"
          +       encoding.codec = "json"
          + 
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
          -   - systemctl enable --now monit
          +   - systemctl enable --now monit vector
        EOT
      ~ vars     = {
          + "cloudwatch_log_group"            = "staging_external"
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
            # (8 unchanged elements hidden)
        }
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "5a71063c3f53d0a0d11d464b75e565c1c637dc68204133ab57aa5020eb484867" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=internal.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit
        EOT -> (known after apply)
      ~ template = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=${osbuild_commit}
                  COMPOSER_COMMIT=${composer_commit}
                  OSBUILD_CA_CERT=${osbuild_ca_cert}
                  COMPOSER_HOST=${composer_host}
                  COMPOSER_ADDRESS=${composer_address}
                  WORKER_SSL_KEYS_ARN=${worker_ssl_keys_arn}
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=${subscription_manager_command}
                  SYSTEM_HOSTNAME_PREFIX=${system_hostname_prefix}
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://${secrets_manager_endpoint_domain}/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
          +   - path: /etc/vector/vector.toml
          +     content: |
          +       [sources.journald]
          +       type = "journald"
          +       exclude_units = ["vector.service"]
          + 
          +       [sinks.out]
          +       type = "aws_cloudwatch_logs"
          +       inputs = [ "journald" ]
          +       endpoint = "https://${cloudwatch_logs_endpoint_domain}/"
          +       group_name = "${cloudwatch_log_group}"
          +       stream_name = "worker_syslog"
          +       encoding.codec = "json"
          + 
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
          -   - systemctl enable --now monit
          +   - systemctl enable --now monit vector
        EOT
      ~ vars     = {
          + "cloudwatch_log_group"            = "staging_internal"
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
            # (8 unchanged elements hidden)
        }
    }

  # aws_cloudwatch_log_group.external_composer must be replaced
-/+ resource "aws_cloudwatch_log_group" "external_composer" {
      ~ arn               = "arn:aws:logs:us-east-1:933752197999:log-group:external_composer_staging" -> (known after apply)
      ~ id                = "external_composer_staging" -> (known after apply)
      ~ name              = "external_composer_staging" -> "staging_external" # forces replacement
        tags              = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External composer log group for staging"
            "ServiceOwner" = "Image Builder"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_cloudwatch_log_group.internal_composer must be replaced
-/+ resource "aws_cloudwatch_log_group" "internal_composer" {
      ~ arn               = "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging" -> (known after apply)
      ~ id                = "internal_composer_staging" -> (known after apply)
      ~ name              = "internal_composer_staging" -> "staging_internal" # forces replacement
        tags              = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Internal composer log group for staging"
            "ServiceOwner" = "Image Builder"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_cloudwatch_log_stream.external_composer_syslog must be replaced
-/+ resource "aws_cloudwatch_log_stream" "external_composer_syslog" {
      ~ arn            = "arn:aws:logs:us-east-1:933752197999:log-group:external_composer_staging:log-stream:external_composer_syslog" -> (known after apply)
      ~ id             = "external_composer_syslog" -> (known after apply)
      ~ log_group_name = "external_composer_staging" -> "staging_external" # forces replacement
      ~ name           = "external_composer_syslog" -> "composer_syslog" # forces replacement
    }

  # aws_cloudwatch_log_stream.external_worker_syslog will be created
  + resource "aws_cloudwatch_log_stream" "external_worker_syslog" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "staging_external"
      + name           = "worker_syslog"
    }

  # aws_cloudwatch_log_stream.internal_composer_syslog must be replaced
-/+ resource "aws_cloudwatch_log_stream" "internal_composer_syslog" {
      ~ arn            = "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging:log-stream:internal_composer_syslog" -> (known after apply)
      ~ id             = "internal_composer_syslog" -> (known after apply)
      ~ log_group_name = "internal_composer_staging" -> "staging_internal" # forces replacement
      ~ name           = "internal_composer_syslog" -> "composer_syslog" # forces replacement
    }

  # aws_cloudwatch_log_stream.internal_worker_syslog will be created
  + resource "aws_cloudwatch_log_stream" "internal_worker_syslog" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "staging_internal"
      + name           = "worker_syslog"
    }

  # aws_iam_policy.external_cloudwatch_logging will be updated in-place
  ~ resource "aws_iam_policy" "external_cloudwatch_logging" {
        id     = "arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging"
        name   = "external_cloudwatch_logging_staging"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "BasicCloudWatchUsage"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:933752197999:log-group:external_composer_staging:log-stream:external_composer_syslog",
                          - "arn:aws:logs:us-east-1:933752197999:log-group:external_composer_staging",
                        ]
                      - Sid      = "CloudWatchSendLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.internal_cloudwatch_logging will be updated in-place
  ~ resource "aws_iam_policy" "internal_cloudwatch_logging" {
        id     = "arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging"
        name   = "internal_cloudwatch_logging_staging"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "cloudwatch:PutMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "BasicCloudWatchUsage"
                    },
                  - {
                      - Action   = "logs:PutLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging:log-stream:internal_composer_syslog"
                      - Sid      = "CloudWatchPutLogEvents"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:DescribeLogGroups",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-1:933752197999:log-group:internal_composer_staging:log-stream:"
                      - Sid      = "CloudWatchDescribeLogStreams"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-058038b85675d1cd3" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-058038b85675d1cd3" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9Q66XLiSJr/ieh3yHF7o2eiRiBx2MbdnhgOicNIGJ3A7ASRUiZIKJVSKVNc1fUi+2f/7uPtI2xIHIVdrj4mJmJn/AeU+u78btyJKceUC+Y+wY8gyggPEpjyShTsMPoRuHFGEUz3TzfqQJXbY0vrtvTZTSl/EmycsiCmj0Aqi9+VvisJwjXQd6Uz7W7AkpgFvICFnEPPjzDlP4JlQDCFEX66CWjAy95ydfMFy0whZUucCjL1YhTQ1SO4dwN+BVCIzPGOVzwSZ0jwYroMVt+V1CDCXwn3/TVMqZQxnLLHEgACyCV4BNirCvlhCQAAGPMXMON+nAYHjBYh3hew+Z8AbhjzhZRB0Gq1Wu2adoAdae9V5fyx25q02q1Wq9OadHbrpTIYkN6yQ5uBR/r7yEnldmpaVTK646HRMyWc3KPOy2ErrWd3DvUn5GWqJvglDbSdNiW9B88ZNyu6krSReGgqW23/IVyu/OYy22uzenPwQYV3471pt1cNX4uV3VKf9hpBn3sVY0KoKyvBc2KEdRIkcX0y520erVofV6HRuuse/P3KvcsaajPYmYNd3WmvM0MVe9PJQVsneLkPnOwDG+gf/KqVTsLnVjvLBrOJm67JB8W3IzjapJu9Oa5mbMw3dNZe++7Ldj++rzova5g8o0rTN+HHF1naKvs7S6nSqVd/WW3FVTBx71jgKubhXjPxzqk1Js2Hj8lk7KizZy9ZzVNiwH7/eW6oPj+M71U0T8cjxZrGhtTCrX195XNPS8dtk7gNY/NyXzscxI9tXal6nXF9LG6Txnb78cXfbKuUu7XEHL1whPnwg90QJy80odO9YdB5Uj0oWw9XJXe6u7unfpNQf5TOV2t878UT+tJSdhWP1O5kY7hfBdmL195+CKWHWUZm6tT6CNs83A5Hob7uJmtzWsUNdSjdxd17Nux79YrTCPfL0QapzPbRR6kz7fdse5wc4pUrNhv2LBD1qZLQuV6RsL3qVPQPjr3ns+XsQUyX9thDrbjamy/psHGY6dZ0OGyq8xDS3a4m31vjIJSHWpNZ66ooHu46+704WA4+mu5QajeW90tUg56ejupdb2YhZVCR2nvNuVOk9b03D1q98fBZcw9TRTRrfPmwE7E0eXoCEVzH6V9TjHzIy14c3bz2d4yqjYbULHy+c/R5Mu8OJM2UG/nZ4KUtrRVST+4Usx3s+ubddhzeTR/oujK/x/GLNpErqrh9rj80nkHsZggGr5iVtmnA8SLPCKewTCD3H0GFR8kxvBd5jlhsYMoKybxjFngEP58EHRttazDqLjpjVR2YTw81Dy4fRBE3qo1q3a1L9eX9suEuGxCLqOY1par30JSa1RN2Z6y+jA1ZP6PfLxu4dodQs/4gNcQl9OquWLur3Xl3qNZ03fs7XMUPElq+Zd5adGTdfBoZIh8ZUke30NAM2l3dHlqGNR9ORMXSi3ci74TS0LB02Za17sSZT+eiUjOsYXsuEtvqahO1OjtodrtnhQ3Jrc5FHKkNsxtW9Z5vuVW9jURdd6xk5ErJEPbnazNUdN3aPk+I0kbi/KNu29okJP2Jqdi6pdSQuAtUsZHMFcQ8Kelq0/nadbSa0fPXZih9nEzRiy3bd6atz7ElybapTWFPG5vTpI22Sf6u/updqExNe6gj0aaOpTuWrci6rIgoUvfGWvHtmp+aPbGB7eRuImptSyQ1XVHmRsg3TkhiFGnjTiHzsGNZijyvIsWSFbmAdZrd/HkSKtqEtlPHVmaGramzgz9ynESzbEIxbetjS2ur0nCkRmigd9u72VQ5oPXqeWYP13aoVjWiNuahv9Mtawetne3IDzW1O9Tx2j7AahKrtWRn9knfWvs1i8w2o6o2VJ3Bzlu3bWwn5kzcQVXyarad7CfbWNS6ejSrxQdzSuquot3Zkj23pDadhGQEe6g97ivcI4mhOs1o5uh73LcNs8MPbjiXDYfX1ZqXzg7K89y2MzXSmKqgpENs0ekO+7o07+oEaWZV2cxDPXUUu6tTe2T00bPloJ7Z1w+GrEHH0SJEkGMoCdTCeh2JaKsSBTrmoDE7+JI7bX9U7dazJc+ZI6v1eU+Bpiz5jkIC3WxrxlR3VFkbGLRd00WynVGSuTax3A4/6NSuul19Y/ekPe7HGzz17zxZr9qh9OKFytCdJHW3ymoesbndt0O9ZyuWNOyYVdRWLS7NLMmw+7ZvTNu6exiGbm2+ez60dno0O0ys+t62tDYS7fbEUca2LPX0KRpYNpE7ZG6ocrMzIUTRw7g2N+cztRZu570m84zm84zMk1lIElTVM0tqpVoodcYyaqu2HRpTpDuW1JlZSs9YI6KR1QGb7dCtbp+/gds+4+pTpEyCZs2y5trEkjoTZ1Z/P652Fx+drJK2TpOqViXEEL2GqyQjLxzsTUeCUFZ2hkxU7Ox8s0Ycz/Rq+oF0THto6VTbOtQS1f6gpkt6bSbqMYpWkm5pG0NRgk60S5HZnmlWczYX9arT1zper9kz+sOqKvMXw9mZmmQ/q9PZVuuxjUEIdfpe6vYSy+6rm/E02bpr37CjHff61kYXpRfTtJ4tZ9i3OnwM1zb0Dnaki/MplOs10xxIlsPtcXf47PZ9YoQKs6b+YFLdda2eXbdCTZuZSkObtmp2r0HH3fbIIEjEdnsyniSiVUXahLZqmm0bc+dB1CyrbsnJ3qCtA+yTjaYM62N7qOtVvseOZhhTFE1CvwprvmZE88yrqjXHaFY1h0j62udYlu46a02chXHjWUwauqVIRj/ezUIkeZY2e64pz5atW6jT1N3DbI9CNJ1ZYcOS5qMZUesz21cnh+FYo8oaOsOdt7bq87UuG+Hk2aAaM42HmtfXGt5a2WhTXZyFw0wjoTSZqs1OcMzJutWQB7KmWEQf6iHpTmxdOeZy8fltpTCM0eJZnhmLlq49wZQ+wi17ZNhLMWcRpHCF08eMCRgyLkiPzVrtvlGVmvfNZvME9Yh3HKcUkoUXR0nMcFp0msKqIYsr88TOsNpGRx+8mIOxtlBbWqt3KlItrfuPc2aZy7w0SPKeXDihCF4cRZAiIZzMSNw8858Zpqwu+mPD1FqqvHjRZWUwfWIcrgK6Es4qCGcV3lqpO9CfKph7lZi5WUDQW0BD7uiyaVxUk7Xuy3igmQtLHz35nCfssVJ5rVv5olsZRvAQU7hleRdRue4b3mP51UGZxxF5v534Wxivg7+fHiAh8RajBYojGFAGnsDfwA3HMCqfKJbjdHXzZ3DjZ27ZTfH27fk2TkOcfv0KnDl4EDyBm/el9qDgpbyc4LxPOkl3JPi75funyfHG0lFMA55675vye6Dmr8Fx9spSmHsdWMYpGERwhUE7Z4NTEFDQcozyBasbe+wRnH0gKngU91x8q6DYy/I5siB3PCv7PCKlC4GOj70Q4A1O96AmAoa9mCIGIEWAxCvAY8D2jMSrM0uGOUAQRzEFNfHqLAc+Qn6h3cpNDqDnYcbAJoD5zAh4RikmBWGMAfcxiM6as5jgaz65WggkccpB9UGq5kKd3uZ/GcMAIpTmxEnsQeLHjF+9h0fuKAroY8Hii2A2ToPlHnAfcrDFP6QY0JgDDHlAVzneUSwcxekexLR4CijjkHoX+Tp9ufN8inxwm4f+hXWwPONmLL+7v4D7xn9cCZbfagN4e49gdnXMfUwB3mEPVDKWVgqVKm5AK0l8iFM35gtIcHqlhUxZlh5NmMYxL1YFbM84jkDA6A8cLDNCXsurDEbySeYC5aVl9kHlWnKWQA9fBH8QvxacB9ErubcB9wMKpH+ySm9D63eqdykXCU5ZwPJoO2m7gWmFBO63ku2/gBWOMXmKkGAJthh4kIIUQ88HHqLlL1Phl0ygjU35j5EP9wjTPz0CB4NtQAiAZAv3DKwwBxDUxRrwcYqBiz2Yx0+8BB4Jctt4OOXstTVzpwapj8nCQxQ4A7MPWt2uLhvGGyGuLbeEAcHXYZoEdPUPGOMXSeYZoV6vXR+lMY+9mBxT4dULxiHP8mxfF2tvrgswRkBc1HcGPoFOKx9LB8qg0zLl3JNOeTv1WVTxYOWor5DhJE/v4PM/pNSlIvyq8l+XiD8UoC5k/uXSDUwRKHBY7i9nMuXXVeUHBjDdBGlM81oANjANoEswAzDF4FwiMCpc4/GC+ruLyveyZg/0sabKmnl25oklW/KrPuVjhjP8pim5br8qQV7wBPdY8ISzSsKpmzrRVWXDaPXkp5v//e//+h9wq461gbmQbVkzi/g8HRiybg86cp7DTyeFT0N+fuy2TPm8xdFlwxqZT7d/hFsG2EcGGKZIiDArsoAgFIILWUrA7UUrIJwBBDdGe3BzexLs5k8nqtjzY3B7pF162xJssMfj9PTxS40Wi7PUw6y8jrO8k0TnVoTvE5w3I+fzsy5455EM4UVGA160OjcnHgynm8DDN3+/dEksoCErxxl/SxNu2aLYKm0h9/wFiVfsTD6gScZPLdSF9aU/whQlcUB5TuR86zn2N3vSM9lVGmfJgsKo4B/Qt53/yQXO4IynGEa/BF/0IxebnHbkZS9G2CusxmJ6UyqlGfUidNyoeX4UI/Bh9xsC+Qgq3ovi2/5OAMc65XECMM1DDQgCjbenTud4Fb/wY8DvWevvBOZjQo6Tyrf2+leZI++rBJzFIAkSnGfW0tG33t8ilr4HPcxfNUBg0C2XBpphtrSOvBh0n27/6OVBIYxYkTIeKxXprlmuNurl02eFQI4Zr0SYQwFBDitnWkKA/pTzaDGGo9xMeQuX32e5pFij0WWierq5/fT+kPVZuP10Jcznm5zcS5p7X5wdBad4e0W3iMcbA/Oi1zv1E+fXeQ69/fSK9edyQdI4WeENQrl0/pbfNcNcuJC6fUXm3+O2T8Y5Dr5ubqDLrfMY6H3taAwdr/KOKn3tF0VJzWFKb2KnyKevptO8HRGOR8IGkgyD/8zDRjhnjmOW/fRLc+/nE8qJSoBy+F/ZA3wGP4P1RyCk4KZsFHgGT/OEAv5yNMj1yL84ybo4jfzlPFuUzui/BHnzG4mBn0FxSWkEhOVvFaD03lri9IshEASY8fjfyde6OCHxPve0EO+PY2feiQbLwMuTxtHfjkDXUwHotK7hyiUXMnxXBwICAvjpp5/A7ac3Pzd8Bn8Bt5+uVy6fr4b1N1wuM0eI9/9/7vzuFu1XffjVnuy1016/uvkW9NErL8Z8x2onFCE3Tm67r8h7Kf8nkD9fzVV4vKPbv4qvl+S2sTDMsZ53pRWENxW6ibBEpZJhtkz5uOP75uj5pixlyRcXZDxO4Qp/KUNZcj7L+9rLmq4ULMEfwCrFSe5qZ56fQSVJ47w5yShnPxaTSulq0pbbBghYMUrv876TYi+fBJZByoopIm+mzYEq6yCg4JNYLtdE8fOPAMWl03CWz1fg9kr5C4/8z00xDIvvy+D4XwME4wRIJQBQTHGp9GXcDZZgqhivp3wASYoh2oMIomLzUui4W7JFQJfxt9hG4ZKVd0v26n2pEKHgp8LwnfVCrggGKEiL7mxfbHECxvKGsZTTREEKhNe2PZJrIZRXx6IHXDIO3SKLFQbPMY83e/vpSpbPr28oFxXhJcwIZ0AE4g34GXCMgQCviOYy5CRfK1UIoOPcHQ15FNBsdxwedsdZPsW5p2AvpkDQN5fVxxEt96Urayc4LfSNaYHq+fE2xwKLt5Z6/OrkHaNcb9iKvunksQED2zTgeU9cAoDHmee/wq6UkzTeBLkYAV0tvNw1ckWKHPCrgMvgXyYf/JY+671oP85np8LXQuuM8S9veQxIscvKIx8CGtN8LKYIpqc1aWHvgAFSLEWDEJN9juTi0veAeZBSjArvTNLYxahc+h6Y4+749dqI4hzouLTNHSgNvOOK5LQJpZhv4zQEBG8wyWdpFkc5/aLU/Rm4GQdbnIf3Dxz4cINBwEEarHwOaLwtly6RVPj20fnQ6fOrxCjAJCiz2AsxL6NKKY+K348Wb3CaBgiXvZgu8zJZZOeMEPDTT0AeK6W/GQXo30ujwrhGMVc+vX5qPtzflXLgL6PdcQ0upJjEEB3nDpzA9Ovc8kNuyCjmGBx/W7jccnEXRzlZ+YpyBFl4oXLE+at0nt1L3xguz/BHVie0kxV+Decdw30VSYLwXen/AgAA///YC0b/CycAAA==" -> "H4sIAAAAAAAA/9Ra6XLjyJH+z4h5h7JGG2NHGyTAQxI1I4d5ADxEgCJOkl4Ho4AqEiAKBTSqwKunX2T/7N99vH2EDYBHU2r1HA5HrK0/JAqZWZlZmVlfJtWJKceUC+Y+wY8gyggPEpjyShTsMPoRuHFGEUz3TzfqQJXbY0vrtvTZTSl/EmycsiCmj0Aqi9+VvisJwjXRd6Wz7G7AkpgFvKCFnEPPjzDlP4JlQDCFEX66CWjAy95ydfOFy0whZUucCjL1YhTQ1SO4dwN+RVCozPGOVzwSZ0jwYroMVt+V1CDCXyn3/TVNqZQxnLLHEgACyDV4BNirCvliCQAAGPMXMON+nAYHjBYh3he0+Z8AbhjzhZRB0Gq1Wu2adoAdae9V5fyx25q02q1Wq9OadHbrpTIYkN6yQ5uBR/r7yEnldmpaVTK646HRMyWc3KPOy2ErrWd3DvUn5GWqJvglDbSdNiW9B88ZNyu6krSReGgqW23/IVyu/OYy22uzenPwQYV3471pt1cNX4uV3VKf9hpBn3sVY0KoKyvBc2KEdRIkcX0y520erVofV6HRuuse/P3KvcsaajPYmYNd3WmvM0MVe9PJQVsneLkPnOwDG+gf/KqVTsLnVjvLBrOJm67JB8W3IzjapJu9Oa5mbMw3dNZe++7Ldj++rzova5g8o0rTN+HHF1naKvs7S6nSqVd/WW3FVTBx71jgKubhXjPxzqk1Js2Hj8lk7KizZy9ZzVNiwH7/eW6oPj+M71U0T8cjxZrGhtTCrX195XNPS8dtk7gNY/NyXzscxI9tXal6nXF9LG6Txnb78cXfbKuUu7XEHL1whPnwg90QJy80odO9YdB5Uj0oWw9XJXe6u7unfpNQf5TOV2t878UT+tJSdhWP1O5kY7hfBdmL195+CKWHWUZm6tT6CNs83A5Hob7uJmtzWsUNdSjdxd17Nux79YrTCPfL0QapzPbRR6kz7fdse5wc4pUrNhv2LBD1qZLQuV6RsL3qVPQPjr3ns+XsQUyX9thDrbjamy/psHGY6dZ0OGyq8xDS3a4m31vjIJSHWpNZ66ooHu46+704WA4+mu5QajeW90tUg56ejupdb2YhZVCR2nvNuVOk9b03D1q98fBZcw9TRTRrfPmwE7E0eXoCEVzH6V9TjHzIy14c3byOd4yqjYbULGK+c4x5Mu8OJM2UG/na4KUtrRVST+4Usx3s+ubddhzeTR/oujK/x/GLNpErqrh9rj80nkHsZggGrzYrbdOA40VeEU5pmUDuP4IKj5Jjei/yGrHYwJQVmnnHKvAIfj4pOjba1mDUXXTGqjownx5qHlw+iCJuVBvVuluX6sv7ZcNdNiAWUc1rSlXvoSk1qyfuzlh9GRuyfma/XzZw7Q6hZv1BaohL6NVdsXZXu/PuUK3puvd3uIofJLR8u3lr0ZF182lkiHxkSB3dQkMzaHd1e2gZ1nw4ERVLL96JvBNKQ8PSZVvWuhNnPp2LSs2whu25SGyrq03U6uyg2e2eFTYktzoXcaQ2zG5Y1Xu+5Vb1NhJ13bGSkSslQ9ifr81Q0XVr+zwhShuJ84+6bWuTkPQnpmLrllJD4i5QxUYyVxDzpKSrTedr19FqRs9fm6H0cTJFL7Zs35m2PseWJNumNoU9bWxOkzbaJvm7+qt3oTI17aGORJs6lu5YtiLrsiKiSN0ba8W3a35q9sQGtpO7iai1LZHUdEWZGyHfOCGJUaSNO4XOw45lKfK8ihRLVuSC1ml28+dJqGgT2k4dW5kZtqbODv7IcRLNsgnFtK2PLa2tSsORGqGB3m3vZlPlgNar55k9XNuhWtWI2piH/k63rB20drYjP9TU7lDHa/sAq0ms1pKd2Sd9a+3XLDLbjKraUHUGO2/dtrGdmDNxB1XJq9l2sp9sY1Hr6tGsFh/MKam7inZnS/bcktp0EpIR7KH2uK9wjySG6jSjmaPvcd82zA4/uOFcNhxeV2teOjsoz3PbztRIY6qCkg6xRac77OvSvKsTpJlVZTMP9dRR7K5O7ZHRR8+Wg3pmXz8YsgYdR4sQQY6hJFAL63Ukoq1KFOiYg8bs4EvutP1RtVvPljxnjqzW5z0FmrLkOwoJdLOtGVPdUWVtYNB2TRfJdkZJ5trEcjv8oFO76nb1jd2T9rgfb/DUv/NkvWqH0osXKkN3ktTdKqt5xOZ23w71nq1Y0rBjVlFbtbg0syTD7tu+MW3r7mEYurX57vnQ2unR7DCx6nvb0tpItNsTRxnbstTTp2hg2UTukLmhys3OhBBFD+Pa3JzP1Fq4nfeazDOazzMyT2YhSVBVzyyplWqh1BnLqK3admhMke5YUmdmKT1jjYhGVgdstkO3un3+Bm/7zKtPkTIJmjXLmmsTS+pMnFn9/bzaXWJ0skraOk2qWpUQQ/QarpKMvHCwNx0JQlnZGTJRsbPzzRpxPNOr6QfSMe2hpVNt61BLVPuDmi7ptZmoxyhaSbqlbQxFCTrRLkVme6ZZzdlc1KtOX+t4vWbP6A+rqsxfDGdnapL9rE5nW63HNgYh1Ol7qdtLLLuvbsbTZOuufcOOdtzrWxtdlF5M03q2nGHf6vAxXNvQO9iRLs6nUK7XTHMgWQ63x93hs9v3iREqzJr6g0l117V6dt0KNW1mKg1t2qrZvQYdd9sjgyAR2+3JeJKIVhVpE9qqabZtzJ0HUbOsuiUne4O2DrBPNpoyrI/toa5X+R47mmFMUTQJ/Sqs+ZoRzTOvqtYco1nVHCLpa59jWbrrrDVxFsaNZzFp6JYiGf14NwuR5Fna7LmmPFu2bqFOU3cPsz0K0XRmhQ1Lmo9mRK3PbF+dHIZjjSpr6Ax33tqqz9e6bISTZ4NqzDQeal5fa3hrZaNNdXEWDjONhNJkqjY7wbEm61ZDHsiaYhF9qIekO7F15VjLxee3N4VhjBbP8sxYtHTtCab0EW7ZI8NeijmLIIUrnD5mTMCQcUF6bNZq942q1LxvNpsnqke84zilkCy8OEpihtMCaQqrhiyuzNN2htU2OvrgxRyMtYXa0lq90yXV0rr/+M4sc5mXBkmOyYUTi+DFUQQpEsLJjMTN8/4zw5TVRX9smFpLlRcvuqwMpk+Mw1VAV8LZBOFswlsvdQf6UwVzrxIzNwsIektoyB1dNo2LabLWfRkPNHNh6aMnn/OEPVYqr20rX2wrwwgeYgq3LEcRlWvc8N6WXy2UeRyR9+HE38J4Hfz99AAJibcYLVAcwYAy8AT+Bm44hlH5JLEcp6ubP4MbP3PLboq3b9e3cRri9OtX4LyDB8ETuHlfaw8KXsrLCc5x0km7o8Dfrd8/TY83no5iGvDUe9+V3wM1fw2OvVeWwjzqwDJOwSCCKwza+TY4BQEFLccoX7i6sccewTkGomKP4pyLbxUUe1neRxbijmtln0ekdBHQ8bEXArzB6R7URMCwF1PEAKQIkHgFeAzYnpF4dd6SYQ4QxFFMQU28WsuJj5RfZLdylwPoeZgxsAlg3jMCnlGKSSEYY8B9DKKz5Swm+Hqf3CwEkjjloPogVXOlTm/zv4xhABFKc+Ek9iDxY8av3sPj7igK6GOxxRfFbJwGyz3gPuRgi39IMaAxBxjygK5yvqNaOIrTPYhp8RRQxiH1Lvp1+nLn+ZT54DZP/cvWwfLMm7H87P4C7hv/caVYfqoN4O09gtnVMvcxBXiHPVDJWFopTKq4Aa0k8SFO3ZgvIMHplRUyZVl6dGEax7wYFbA94zgCAaM/cLDMCHmtrzIYySedC5aXltkHlWvNWQI9fFH8QfxacR5Er/TeBtwPKJD+ySa9Ta3fad7lukhwygKWZ9vJ2g1MKyRwv1Vs/wW8cMzJU4YES7DFwIMUpBh6PvAQLX/pCr9UAm1syn+MfLhHmP7pETgYbANCACRbuGdghTmAoC7WgI9TDFzswTx/4iXwSJD7xsMpZ6+9mQc1SH1MFh6iwBmYfdDqdnXZMN4oce25JQwIvk7TJKCrf8AZvygyrwj1eu16KY157MXkWAqvXjAOeZZX+7pYe3NcgDEC4uJ+Z+AT6LTytnSgDDotU84j6VS3U59FFQ9WjvYKGU7y8g4+/0NGXW6EXzX+6yviDwWpC5l/OXQDUwQKHpbHy1lM+fWt8gMDmG6CNKb5XQA2MA2gSzADMMXgfEVgVITG44X1d18q38uaPdDHmipr5jmYJ5Zsya9wyscMZ/gNKLmGX5Ugv/AE93jhCWeThBOaOslVZcNo9eSnm//97//6H3CrjrWBuZBtWTOL/DwtGLJuDzpyXsNPK0VMQ35+7LZM+TzF0WXDGplPt3+EWwbYRwYYpkiIMCuqgCAUigtZSsDtxSognAkEN0Z7cHN7UuzmTyep2PNjcHuUXXoLCTbY43F6+vgloMXiLPUwK6/jLEeS6AxF+D7BORg5r59twTuPZAgvMhrwAurcnPZgON0EHr75+wUlsYCGrBxn/K1MuGWLYqq0hdzzFyResbP4gCYZP0Goy9YXfIQpSuKA8lzI+dRz7m9i0rPYVRpnyYLCqNj/dOCLM3w+UzGeYhhdyC6F/og+Lh44TcTLXoywV/iIxfSmVEoz6kXoOD/z/ChG4MPuN6TtkVS8F8W3aE4Ax1vJ4wRgmicWEAQab0+45uj4Xxj9/54h/k5gPibk2Jd8a4p/VSdyFCXgLAZJkOC8jpaOkfT+zLD0Pehh/grugEG3XBpohtnSOvJi0H26/aOXp4AwYkWBeKxUpLtmudqol0+fFQI5ZrwSYQ4FBDmsnGUJAfpTvkeLMRzlbsoBW36M5ZJijUaX/unp5vbT+y3VZ+H205Uyn29ycS9pHmtxdlSc4u2V3CL7bgzMC2R3Qg/n13nFvP30auvP5UKkcfLCG4Zy6fwtP2uGuXARdftKzL/HaZ+cc2xz3dxBl1PnMdD72tEZOl7l+Cl9HRfFBZrTlN7kTlE9X/WiOfgQjkvCBpIMg//M00Y414ljTf30S13u5xPLSUqAcvpf6fo/g5/B+iMQUnBTNgo+g6cBXd2Avxwdct3gL066Lk4NfjmvFqUz+y9R3vxGYeBnUBxSGgFh+VsVKL03hDj9PggEAWY8/neKtS5OSLzPIy3E+2OTmePOYBl4edE4xtuR6LoHAJ3WNV255EKG7+pAQEAAP/30E7j99ObHhc/gL+D20/WA5fNVa/5ml0uHEeL9/184vzsz+9UYfjUVex20169uvkV9jMqLM9/x2olFyJ2T++4r8V7K/wniz0dzlR7v2PavEusluW0sDHOs5xi0gvCmQjcRlqhUMsyWKR8net9sNN9cS1nyJQQZj1O4wl+uoSw5r+Uo9jKUKwVL8AewSnGSh9p5z8+gkqRxDk4yytmPRV9Suuqr5bYBAlY0zvscZVLs5bh/GaSs6Bly6GwOVFkHAQWfxHK5JoqffwQoLp1asbybArdXxl/2yP/cFMOw+L4Mjv8jQDBOgFQCAMUUl0pfmttgCaaK8bqnB5CkGKI9iCAq5iyFjbslWwR0GX9r2yhcsvJuyV69LxUqFPupMHxnmJAbggEK0gKd7YuZTcBYDhhLuUwUpEB47dujuBZC+e1YYMAl49Atqljh8JzzeLK3n650+fz6hHJVEV7CjHAGRCDegJ8BxxgI8EporkMu8rVRhQI6zsPRkEcBzXbHVmF37NxTnEcK9mIKBH1zGXQc2fJYuvJ2gtPC3pgWrJ4fb3MusHjrqcevVt5xyvU8rcBNp4gNGNimAc8xcQkAHmee/4q7Uk7SeBPkauRI38tDIzekqAG/SrgM/mXqwW/BWe9l+7EbO118LbTOGP/ylseAFJOrPPMhoDHNm2CKYHoaihb+DhggxQg0CDHZ50wuLn0PmAcpxaiIziSNXYzKpe+BOe6OXw+JKM6JjiPaPIDSwDsORE5zT4r5Nk5DQPAGk7xzZnGUyy+uuj8DN+Ngi/P0/oEDH24wCDhIg5XPAY235dIlk4rYPgYfOn1+VRgFmARlFnsh5mVUKeVZ8fvZ4g1O0wDhshfTZX5NFtU5IwT89BOQx0rpb0ZB+vfSqHCuUbSTT6+fmg/3d6Wc+Etrdxx6CykmMUTHvgMnMP26tvyQOzKKOQbHXxIup1ycxVFPVr6SHEEWXqQcef4qnTv10jeayzP9casT28kLv8bzjuO+yiRB+K70fwEAAP//CDmYovkmAAA=" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0441008615a4e7b29" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-03a9bf86f1172bd06" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-03a9bf86f1172bd06" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9Ra63KjSJb+r4h+hxyXN3omapBASLLlbk+MLqCLBbK4SpqdUCRkSiAgwWSiW3W9yP7Zv/t4+wgboEvJLld198RE7Iz/qEjOPU+e/M6hOjFhmDDO2Cf4AURZyPwEpqwS+TuMfgJOnBEE0/3jjTJQpPbYVLstbXZTyp84C6fUj8kDEMr8D6UfShx3TfRD6Sy769Mkpj4raCFj0PUiTNhPYOmHmMAIP974xGdld7m6+cJlpJDQJU45ibgx8snqAdw5PrsiKExmeMcqbhhniHNjsvRXP5QUP8JfGffhmqZUyihO6UMJAA7kFjwA7Fa5fLEEAACUeguYMS9O/QNGiwDvC9r8jwM3lHpcSiFotVqttqgeYEfYu1Upf+y2Jq12q9XqtCad3XopDwZhb9khTd8N+/vITqV2apjVcNRggd4zBJzcoc7zYSusZw2beJPweaok+Dn11Z06DXv3rj1uVjQ5aSP+0JS36v5jsFx5zWW2V2e15uCjAhvjvWG1V3VPjeXdUpv26n6fuRV9EhJHkv2nRA9qoZ/EtcmctVm0ar2sAr3V6B68/cppZHWl6e+Mwa5mt9eZrvC96eSgrhO83Pt29pEOtI9e1UwnwVOrnWWD2cRJ1+FH2bMiONqkm70xrmZ0zDZk1l57zvN2P76r2s9rmDyhStMz4MuzJGzlfcOUq2Tq1p5XW37lT5wG9R3ZONypBt7ZYn3SvH9JJmNbmT25yWqehjrs95/muuKxw/hOQfN0PJLNaawLLdza11Yec9V03DZCp65vnu/Ew4F/aWty1e2Ma2N+m9S325dnb7OtEuaIiTF6Zgiz4Uerzk+eSUKme10n86R6kLcurgrOdNe4I14zJN4ona/W+M6NJ+S5Je8qbig2JH24X/nZs9vefgyE+1kWzpSp+QLbLNgOR4G27iZrY1rFdWUoNOLuHR323VrFrgf75WiDFGp56EXoTPs9yxonh3jl8M26NfN5bSonZK5VBGytOhXto23t2Ww5u+fTpTV2USuu9uZLMqwfZpo5HQ6byjyAZLcTpTtz7AfSUG1Sc13l+UOjs9/zg+XgxXCGQru+vFsiEbpaOqp13ZmJ5EFFaO9VuyEL6zt37rd64+GT6hymMm+IbHm/47EweXwEEVzH6V9TjDzIym4c3bzOd4yq9brQLHK+c8z5cN4dCKoh1fO1wXNbWMthLWnIRtvf9Y3Gdhw0pvdkXZnf4fhZnUgVhd8+1e7rTyB2MgT9V8pK29RneJFXhNOxTCDzHkCFRcnxeC/yGrHYwJQWlrnHKvAAfjkZOtbb5mDUXXTGijIwHu9FFy7veR7Xq/VqzakJteXdsu4s6xDzSHSbQtW9bwrN6om7M1aex7qkndnvlnUsNhBq1u6FOr+Ebs3hxYbYcBtIbDrOXQNX8b2Alm+VtxYdSTMeRzrPRrrQ0Uw0NPx2V7OGpm7OhxNeNrXiHc86gTDUTU2yJLU7sefTOS+Lujlsz/nQMrvqRKnODqrV7plBXXCqcx5HSt3oBlWt55lOVWsjXtNsMxk5QjKE/fnaCGRNM7dPk1BuI37+olmWOgnC/sSQLc2URcTvfIWvJ3MZUVdIuup0vnZsVdR73toIhJfJFD1bktUwLG2OTUGyDHUKe+rYmCZttE3yd7VX7wJ5alhDDfEWsU3NNi1Z0iSZR5Gy19eyZ4leavT4OraSxoRX2yYfiposz/WAbewgjFGkjjuFzcOOacrSvIpkU5KlgtZudvPnSSCrE9JObUue6ZaqzA7eyLYT1bRCgklbG5tqWxGGIyVCA63b3s2m8gGtV08za7i2AqWqhkp9Hng7zTR30NxZtnQvKt2hhtfWAVaTWBGTndEP++baE81wthlV1aFiD3buum1hKzFm/A4qgitaVrKfbGNe7WrRTIwPxjSsObLasARrbgptMgnCEeyh9rgvMzdMdMVuRjNb2+O+pRsddnCCuaTbrKaIbjo7yE9zy8qUSKWKjJJOaPF2d9jXhHlXC5FqVOXNPNBSW7a6GrFGeh89mTbqGX3toEsqtG01QiGydTmBalCrIR5tlVCGtjGozw6e4EzbL4rVejKlObUlpTbvydCQBM+WQ18z2qo+1WxFUgc6aYsaH25nJMwcKzSdDjtoxKo6XW1j9YQ97scbPPUarqRVrUB4dgN56EySmlOlohtazOpbgdazZFMYdowqaismE2amoFt9y9Onbc05DANHnO+eDq2dFs0OE7O2t0y1jXirPbHlsSUJPW2KBqYVSp1writSszMJQ1kLYnFuzGeKGGznvSZ19ebTLJwnsyBMUFXLTKGVqoHQGUuorVhWoE+RZptCZ2bKPX2NQjVcHbDRDpzq9ukbvO0zrzZF8sRviqY5Vyem0JnYs9r752p3ydHJKmlrJKmq1TDUebfuyMnIDQZ7wxYglOSdLoUKtneeIYa2a7iidgg7hjU0NaJubWLySn8gaoImzngtRtFK0Ex1o8uy34l2KTLaM9Vszua8VrX7asftNXt6f1hVJPas2ztDFawnZTrbqj260cOQ2H03dXqJafWVzXiabJ21p1vRjrl9c6PxwrNhmE+mPeybHTaGawu6ByvS+PkUSjXRMAaCaTNr3B0+OX0v1AOZmlNvMKnuumbPqpmBqs4Mua5OW6LVq5Nxtz3SQ8Rjqz0ZTxLerCJ1Qlqialn63L7nVdOsmVKy10nrAPvhRpWHtbE11LQq22Nb1fUpiiaBV4Wip+rRPHOrimjrzapqh4K29hiWhEZnrfKzIK4/8UldM2VB78e7WYAE11RnT6L8ZFqaiTpNzTnM9ihA05kZ1E1hPpqFSm1mecrkMByrRF5De7hz12ZtvtYkPZg86USlhn4vun217q7ljTrV+FkwzNQwECZTpdnxjzVZM+vSQFJlM9SGWhB2J5YmH2s5//T2ptD10eJJmumLlqY+wpQ8wC19oNhNMaMRJHCF04eMchhSxgkPTVG8q1eF5l2z2TxRPfiE4ZTAcOHGURJTnBZIk6PxJq0FJ3W62dY72uDZGIzVhdJSW73TJdVSu/+4Zpo51E39JMfk3ImFc+MoggRxwWQWxs2z/pluSMqiP9YNtaVIi2dNkgfTR8rgyicr7uwCd3bhbZS6A+2xgplbiamT+SF6S6hLHU0y9Itrktp9Hg9UY2Fqo0ePsYQ+VCqbxMUcjwRRqNdEvlGvNR3BRVzzsEvvDvVN+bXv5Yvv5ZyxDCN4iAnc0hxqVK7BxXt2fbVQZnEUvo85/hbEa//vpwcYhvEWowWKI+gTCh7B38ANwzAqnySW43R182dw42VO2Unx9u36Nk4DnH79Cpw1uBA8gpv3rXYh56asnOAcTJ2sOwr83fb90+x4E+koJj5L3fdD+QEo+WtwbNCyFOapCZZxCgYRXGHQztXgFPgEtGy9fOHqxi59AOdEiQodxT4X/6qg2M3yZrMQd1wreywKSxcBHQ+7AcAbnO6ByAOK3ZggCiBBIIxXgMWA7mkYr84qKWYAQRzFBIj81VpOfKT8IruVhxxA18WUgo0P88YSsIwQHBaCMQbMwyA6e07jEF/ryd1CIIlTBqr3QjU36vQ2/8soBhChNBcexi4MvZiyq/fwqB1FPnkoVHwxzMKpv9wD5kEGtvjHFAMSM4Ah88kq5zuahaM43YOYFE8+oQwS92Jfpy91nk7lAdzm9eGi2l+eeTOa791fwF39P64My3e1Dty9G2J6tcw8TADeYRdUMppWCpcqjk8qSXyIUydmCxji9MoLidAsPYYwjWNWzBPonjIcAZ+SHxlYZmH42l55MJJONhcszy2jDyrXltMEuvhi+D3/teHMj17ZvfWZ5xMg/JNdenu0fqd7lzslwSn1aX7aTt5uYFoJfedbFflfIArHM3k6If4SbDFwIQEphq4HXETKX1rHL5VAHRvSHyMP7hEmf3oANgZbPwwBDLdwT8EKMwBBjReBh1MMHOzC/PzES+CGfh4bF6eMvo5mntQg9XC4cBEB9sDog1a3q0m6/saI68gtoR/i62Oa+GT1DwTjuyLzilCriddLacxiNw6PpfDqBWWQZXm1r/Him+0ClIYgLkAABZ9Ap5X3rgN50GkZUp5Jp7qdejSquLBy9JfLcJKXd/D5H3LqciP8qvNfXxF/KEgdSL3LpuuYIFDw0DxfzmLKr2+VHynAZOOnMcnvArCBqQ+dEFMAUwzOVwRGRWo8XFh/96XyQVKtgTZWFUk1zsk8MSVTegVmXjKcvQUl1xit4ucXHuccLzzu7BJ3glwnuYqk662e9Hjzv//9X/8DbpWxOjAWkiWpRnE+Twu6pFmDjpTX8NNKkdOQnR+7LUM6j3o0STdHxuPtH+GWAvpCAcUEcRGmRRXguMJwLktDcHvxCnBnAs6J0R7c3J4Mu/nTSSp2vRjcHmWX3kKCDXZZnJ5+vge0aJylLqbldZzlcBOdoQjbJzgHI+f1sy9454YZwouM+KyAOjcnHRSnG9/FN3+/oCTqk4CW44y9lQm3dFGMnraQud4ijFf0LN4nScZOEOqi+oKPMEFJ7BOWC3kNYQXMi4ID67woQod36xx+2azi3aZazqV/H7ieda/SOEsWBEaFkV/3EKc8OZNTlmIYfY++AC2XwJ2m7WU3RtgtQktjclMqpRlxI3SczbleFCPwcfcbTvuRlL/j+bcgkAPHy8xlIcAkP4+A40i8PcGh435957PC7/lAsOOoh8Pw2PN86wvBVXnJwReHsxgkfoLz8ls6JuD788jSB9DD7BVKAoNuuTRQdaOldqTFoPt4+0c3PznciBZ15aFSERrNcrVeK59+KyFkmLJKhBnkEGSwcpbF+ehPuY4WpTjKw5TjvHw/yyXZHI0uvdnjze2n99u1z9ztpytjPt/k4p7TPEXj7Gg4wdsrucWhvdExKwDhCXScX+eF9vbTK9Wfy4VI/RSFNwzl0vlf+V5TzLiLqNtXYv49dvsUnGML7eQBuuw6i4HWV4/B0PAqh13p67wo7t2cpvTm7BRF91Ufm2MW7rjEbWCYYfCf+bHhzuXlWIo/fa+D/nxiOUnxUU7/KxOFz+AXsH4BXApuynrBp7M0LyjgL8eAXA8PFidbF6fhQTmvFqUz+/cob36jMPALKDYpjQC3/K0GlN4bcJy+PQKOgxmL/51yrYuTMN7nmRbg/bE3zeGqv/TdvGgc8+1IdN06gE7rmq5cciDFjRrgEODAzz//DG4/vflw8Rn8Bdx+uh7efL7q6N9ouTQmAd7//6Xzu/O4X83hVxO310l7/ermW9THrLwE852onVi4PDh57L4S76bsnyD+vDVXx+Md3/5Vcr0ktfWFboy1HLpWEN5UyCbCAhFKutEypOO08Jv96ZtrKUu+pCBlcQpX+Ms1lCXntRz8XmZ5JX8J/gBWKU7yVDvr/AwqSRrn4CQjjP5UtDOlq3ZcauvAp0W/vc/BKcFu3i4s/ZQWrUaOuI2BImnAJ+ATXy6LPP/5J4Di0qmDy5swcHvl/EVH/uekGB7nvUv/+P8PQowTIJQAQDHBpdKXnthfgqmsvx4FABimGKI9iCAqxjOFj7slXfhkGX9LbRQsaXm3pK/elwoTCn0KDN6ZQeSOYID8tEBn+2LU41OaA8ZSLhP5KeBex/YoroVQfjsWGHBJGXSKKlYEPOc87uztpytbPr/eodxUhJcwCxkFPOBvwC+AYQw4eCU0tyEX+dqpwgAN5+moSyOfZLtjh7E7NvwpzjMFuzEBnLa5zEeObHkuXUU7wWnhb0wKVteLtzkXWLyN1MNXK+8E5XoMV+CmU8b6FGxTn+WYuAQAizPXe8VdKSdpvPFzM3yyWrh5auSOFDXgVwmX/r9MPfgtOOu9035s4k4XXwutM8q+vGUxCIuBV37yISAxyXtngmB6mqUW8fYpCIvJqR/gcJ8zObj0AVAXEoJRkZ1JGjsYlUsfgDHujl/PlgjOiY6T3TyBUt89zlFO41KC2TZOAxDiDQ7zhpvGUS6/uOr+DJyMgS3Oj/ePDHhwg4HPQOqvPAZIvC2XLiepyO1j8qHT71eFkYOJX6axG2BWRpVSfip+P1u8wWnqI1x2Y7LMr8miOmdhCH7+GUhjufQ3vSD9e2lUBFcv+srH10/N+7tGKSf+0todZ+VcisMYomPfgROYfl1bfswDGcUMg+MHiMsuF3txtJOWryRHkAYXKUeevwrnBr/0jebyTH9UdWI7ReHXeN4J3FcnieN+KP1fAAAA//+nEfX3VScAAA==" -> "H4sIAAAAAAAA/9Ra63KjSJb+r4h+hxyXN3omapBASLLlbk+MLqCLBbK4SpqdUCRkSiAgwWSiW3W9yP7Zv/t4+wgboEvJLld198RE7Iz/qEjOPU+e/M6hOjFhmDDO2Cf4AURZyPwEpqwS+TuMfgJOnBEE0/3jjTJQpPbYVLstbXZTyp84C6fUj8kDEMr8D6UfShx3TfRD6Sy769Mkpj4raCFj0PUiTNhPYOmHmMAIP974xGdld7m6+cJlpJDQJU45ibgx8snqAdw5PrsiKExmeMcqbhhniHNjsvRXP5QUP8JfGffhmqZUyihO6UMJAA7kFjwA7Fa5fLEEAACUeguYMS9O/QNGiwDvC9r8jwM3lHpcSiFotVqttqgeYEfYu1Upf+y2Jq12q9XqtCad3XopDwZhb9khTd8N+/vITqV2apjVcNRggd4zBJzcoc7zYSusZw2beJPweaok+Dn11Z06DXv3rj1uVjQ5aSP+0JS36v5jsFx5zWW2V2e15uCjAhvjvWG1V3VPjeXdUpv26n6fuRV9EhJHkv2nRA9qoZ/EtcmctVm0ar2sAr3V6B68/cppZHWl6e+Mwa5mt9eZrvC96eSgrhO83Pt29pEOtI9e1UwnwVOrnWWD2cRJ1+FH2bMiONqkm70xrmZ0zDZk1l57zvN2P76r2s9rmDyhStMz4MuzJGzlfcOUq2Tq1p5XW37lT5wG9R3ZONypBt7ZYn3SvH9JJmNbmT25yWqehjrs95/muuKxw/hOQfN0PJLNaawLLdza11Yec9V03DZCp65vnu/Ew4F/aWty1e2Ma2N+m9S325dnb7OtEuaIiTF6Zgiz4Uerzk+eSUKme10n86R6kLcurgrOdNe4I14zJN4ona/W+M6NJ+S5Je8qbig2JH24X/nZs9vefgyE+1kWzpSp+QLbLNgOR4G27iZrY1rFdWUoNOLuHR323VrFrgf75WiDFGp56EXoTPs9yxonh3jl8M26NfN5bSonZK5VBGytOhXto23t2Ww5u+fTpTV2USuu9uZLMqwfZpo5HQ6byjyAZLcTpTtz7AfSUG1Sc13l+UOjs9/zg+XgxXCGQru+vFsiEbpaOqp13ZmJ5EFFaO9VuyEL6zt37rd64+GT6hymMm+IbHm/47EweXwEEVzH6V9TjDzIym4c3bzOd4yq9brQLHK+c8z5cN4dCKoh1fO1wXNbWMthLWnIRtvf9Y3Gdhw0pvdkXZnf4fhZnUgVhd8+1e7rTyB2MgT9V8pK29RneJFXhNOxTCDzHkCFRcnxeC/yGrHYwJQWlrnHKvAAfjkZOtbb5mDUXXTGijIwHu9FFy7veR7Xq/VqzakJteXdsu4s6xDzSHSbQtW9bwrN6om7M1aex7qkndnvlnUsNhBq1u6FOr+Ebs3hxYbYcBtIbDrOXQNX8b2Alm+VtxYdSTMeRzrPRrrQ0Uw0NPx2V7OGpm7OhxNeNrXiHc86gTDUTU2yJLU7sefTOS+Lujlsz/nQMrvqRKnODqrV7plBXXCqcx5HSt3oBlWt55lOVWsjXtNsMxk5QjKE/fnaCGRNM7dPk1BuI37+olmWOgnC/sSQLc2URcTvfIWvJ3MZUVdIuup0vnZsVdR73toIhJfJFD1bktUwLG2OTUGyDHUKe+rYmCZttE3yd7VX7wJ5alhDDfEWsU3NNi1Z0iSZR5Gy19eyZ4leavT4OraSxoRX2yYfiposz/WAbewgjFGkjjuFzcOOacrSvIpkU5KlgtZudvPnSSCrE9JObUue6ZaqzA7eyLYT1bRCgklbG5tqWxGGIyVCA63b3s2m8gGtV08za7i2AqWqhkp9Hng7zTR30NxZtnQvKt2hhtfWAVaTWBGTndEP++baE81wthlV1aFiD3buum1hKzFm/A4qgitaVrKfbGNe7WrRTIwPxjSsObLasARrbgptMgnCEeyh9rgvMzdMdMVuRjNb2+O+pRsddnCCuaTbrKaIbjo7yE9zy8qUSKWKjJJOaPF2d9jXhHlXC5FqVOXNPNBSW7a6GrFGeh89mTbqGX3toEsqtG01QiGydTmBalCrIR5tlVCGtjGozw6e4EzbL4rVejKlObUlpTbvydCQBM+WQ18z2qo+1WxFUgc6aYsaH25nJMwcKzSdDjtoxKo6XW1j9YQ97scbPPUarqRVrUB4dgN56EySmlOlohtazOpbgdazZFMYdowqaismE2amoFt9y9Onbc05DANHnO+eDq2dFs0OE7O2t0y1jXirPbHlsSUJPW2KBqYVSp1writSszMJQ1kLYnFuzGeKGGznvSZ19ebTLJwnsyBMUFXLTKGVqoHQGUuorVhWoE+RZptCZ2bKPX2NQjVcHbDRDpzq9ukbvO0zrzZF8sRviqY5Vyem0JnYs9r752p3ydHJKmlrJKmq1TDUebfuyMnIDQZ7wxYglOSdLoUKtneeIYa2a7iidgg7hjU0NaJubWLySn8gaoImzngtRtFK0Ex1o8uy34l2KTLaM9Vszua8VrX7asftNXt6f1hVJPas2ztDFawnZTrbqj260cOQ2H03dXqJafWVzXiabJ21p1vRjrl9c6PxwrNhmE+mPeybHTaGawu6ByvS+PkUSjXRMAaCaTNr3B0+OX0v1AOZmlNvMKnuumbPqpmBqs4Mua5OW6LVq5Nxtz3SQ8Rjqz0ZTxLerCJ1Qlqialn63L7nVdOsmVKy10nrAPvhRpWHtbE11LQq22Nb1fUpiiaBV4Wip+rRPHOrimjrzapqh4K29hiWhEZnrfKzIK4/8UldM2VB78e7WYAE11RnT6L8ZFqaiTpNzTnM9ihA05kZ1E1hPpqFSm1mecrkMByrRF5De7hz12ZtvtYkPZg86USlhn4vun217q7ljTrV+FkwzNQwECZTpdnxjzVZM+vSQFJlM9SGWhB2J5YmH2s5//T2ptD10eJJmumLlqY+wpQ8wC19oNhNMaMRJHCF04eMchhSxgkPTVG8q1eF5l2z2TxRPfiE4ZTAcOHGURJTnBZIk6PxJq0FJ3W62dY72uDZGIzVhdJSW73TJdVSu/+4Zpo51E39JMfk3ImFc+MoggRxwWQWxs2z/pluSMqiP9YNtaVIi2dNkgfTR8rgyicr7uwCd3bhbZS6A+2xgplbiamT+SF6S6hLHU0y9Itrktp9Hg9UY2Fqo0ePsYQ+VCqbxMUcjwRRqNdEvlGvNR3BRVzzsEvvDvVN+bXv5Yvv5ZyxDCN4iAnc0hxqVK7BxXt2fbVQZnEUvo85/hbEa//vpwcYhvEWowWKI+gTCh7B38ANwzAqnySW43R182dw42VO2Unx9u36Nk4DnH79Cpw1uBA8gpv3rXYh56asnOAcTJ2sOwr83fb90+x4E+koJj5L3fdD+QEo+WtwbNCyFOapCZZxCgYRXGHQztXgFPgEtGy9fOHqxi59AOdEiQodxT4X/6qg2M3yZrMQd1wreywKSxcBHQ+7AcAbnO6ByAOK3ZggCiBBIIxXgMWA7mkYr84qKWYAQRzFBIj81VpOfKT8IruVhxxA18WUgo0P88YSsIwQHBaCMQbMwyA6e07jEF/ryd1CIIlTBqr3QjU36vQ2/8soBhChNBcexi4MvZiyq/fwqB1FPnkoVHwxzMKpv9wD5kEGtvjHFAMSM4Ah88kq5zuahaM43YOYFE8+oQwS92Jfpy91nk7lAdzm9eGi2l+eeTOa791fwF39P64My3e1Dty9G2J6tcw8TADeYRdUMppWCpcqjk8qSXyIUydmCxji9MoLidAsPYYwjWNWzBPonjIcAZ+SHxlYZmH42l55MJJONhcszy2jDyrXltMEuvhi+D3/teHMj17ZvfWZ5xMg/JNdenu0fqd7lzslwSn1aX7aTt5uYFoJfedbFflfIArHM3k6If4SbDFwIQEphq4HXETKX1rHL5VAHRvSHyMP7hEmf3oANgZbPwwBDLdwT8EKMwBBjReBh1MMHOzC/PzES+CGfh4bF6eMvo5mntQg9XC4cBEB9sDog1a3q0m6/saI68gtoR/i62Oa+GT1DwTjuyLzilCriddLacxiNw6PpfDqBWWQZXm1r/Him+0ClIYgLkAABZ9Ap5X3rgN50GkZUp5Jp7qdejSquLBy9JfLcJKXd/D5H3LqciP8qvNfXxF/KEgdSL3LpuuYIFDw0DxfzmLKr2+VHynAZOOnMcnvArCBqQ+dEFMAUwzOVwRGRWo8XFh/96XyQVKtgTZWFUk1zsk8MSVTegVmXjKcvQUl1xit4ucXHuccLzzu7BJ3glwnuYqk662e9Hjzv//9X/8DbpWxOjAWkiWpRnE+Twu6pFmDjpTX8NNKkdOQnR+7LUM6j3o0STdHxuPtH+GWAvpCAcUEcRGmRRXguMJwLktDcHvxCnBnAs6J0R7c3J4Mu/nTSSp2vRjcHmWX3kKCDXZZnJ5+vge0aJylLqbldZzlcBOdoQjbJzgHI+f1sy9454YZwouM+KyAOjcnHRSnG9/FN3+/oCTqk4CW44y9lQm3dFGMnraQud4ijFf0LN4nScZOEOqi+oKPMEFJ7BOWC3kNYQXMi4ID67woQod36xx+2azi3aZazqV/H7ieda/SOEsWBEaFkaesWJyB+JmKshTD6EJ2uQ2OEOUSptNsvezGCLtFIGlMbkqlNCNuhI6TONeLYgQ+7n7D2T6S8nc8/xbyceB4dbksBJjkpw9wHIm3J/Bz3J3vfET4PZ8Ddhz1cBgeO5xvfQ+4KiY51OJwFoPET3BebEvHdHt/+lj6AHqYvcJEYNAtlwaqbrTUjrQYdB9v/+jm54Qb0aKKPFQqQqNZrtZr5dNvJYQMU1aJMIMcggxWzrI4H/0p19GiFEd5mHJUl29juSSbo9GlE3u8uf30fnP2mbv9dGXM55tc3HOaJ2ScHQ0neHsltziiNzpmBfw7QYzz67ys3n56pfpzuRCpn6LwhqFcOv8r32uKGXcRdftKzL/Hbp+Cc2yYnTxAl11nMdD66jEYGl7lICt9nRfFLZvTlN6cnaLEvupac4TCHZe4DQwzDP4zPzbcuZgcC++n7/XLn08sJyk+yul/ZX7wGfwC1i+AS8FNWS/4dJb6ZHUD/nIMyPWoYHGydXEaFZTzalE6s3+P8uY3CgO/gGKT0ghwy99qQOm9ccbpSyPgOJix+N8p17o4CeN9nmkB3h870Ryc+kvfzYvGMd+ORNeNAui0runKJQdS3KgBDgEO/Pzzz+D205vPFJ/BX8Dtp+tRzeer/v2NlksbEuD9/186vzt9+9UcfjVfe520169uvkV9zMpLMN+J2omFy4OTx+4r8W7K/gniz1tzdTze8e1fJddLUltf6MZYy4FqBeFNhWwiLBChpBstQzrOBr/Zjb65lrLkSwpSFqdwhb9cQ1lyXsuh7mVyV/KX4A9gleIkT7Wzzs+gkqRxDk4ywuhPRfNSumq+pbYOfFp01/scihLs5s3B0k9p0Vjk+NoYKJIGfAI+8eWyyPOffwIoLp36tbzlArdXzl905H9OiuFxurv0j//bIMQ4AUIJABQTXCp96YD9JZjK+uvGH8AwxRDtQQRRMYwpfNwt6cIny/hbaqNgScu7JX31vlSYUOhTYPDOxCF3BAPkpwU62xeDHZ/SHDCWcpnITwH3OrZHcS2E8tuxwIBLyqBTVLEi4DnncWdvP13Z8vn1DuWmIryEWcgo4AF/A34BDGPAwSuhuQ25yNdOFQZoOE9HXRr5JNsd+4ndsb1PcZ4p2I0J4LTNZRpyZMtz6SraCU4Lf2NSsLpevM25wOJtpB6+WnknKNdDtwI3nTLWp2Cb+izHxCUAWJy53ivuSjlJ442fm5EjfTdPjdyRogb8KuHS/5epB78FZ7132o8t2+nia6F1RtmXtywGYTHeyk8+BCQmeadMEExPk9Mi3j4FYTEn9QMc7nMmB5c+AOpCQjAqsjNJYwejcukDMMbd8etJEsE50XGOmydQ6rvHqclpOEow28ZpAEK8wWHeXtM4yuUXV92fgZMxsMX58f6RAQ9uMPAZSP2VxwCJt+XS5SQVuX1MPnT6/aowcjDxyzR2A8zKqFLKT8XvZ4s3OE19hMtuTJb5NVlU5ywMwc8/A2ksl/6mF6R/L42K4OpFO/n4+ql5f9co5cRfWrvjZJxLcRhDdOw7cALTr2vLj3kgo5hhcPzccNnlYi+OdtLyleQI0uAi5cjzV+Hczpe+0Vye6Y+qTmynKPwazzuB++okcdwPpf8LAAD//5mzG1JDJwAA" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-04fdb1c020ef31917" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 7 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ latest_version          = 7 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs94z3BOIakWDK4iuiqrWZYWOK+mhb+JSFBN89VHzna3ayim+Sw8iFVJqDbrVUG40LgTY6QYL6Y5fhkpnvnSNvRnmNMnuCueCoxyzIoEUrjC+dOm4DAsGCc8tSTpoSEKrYdWq3WhevJzvDs1rtyDamNMLvJNWzY7xmBqDSb6i9bW271LzWvr3X9cWbHxC5RHWdnicxcWDqVJAmnAxTOPpK2rfs+0FO2End7WlJepoaiD+fMFPe4KJ7dL8/jSjN8A1x0YzzXMUO0CLndF+ypd6RiKZb4dTNG708lAt15sY/wcMpYVT7Xa+5NV305WhQk8phTuivISa7dNyPdUfrNQZWlCvt+b/DlO19F/XD4gIekOBy9BmsCIFuAZ/BncMQyTW5e5+zdwF278anmNH9fP2Hy7Ba4aEATP4O77ViPIoZxVM1w2XRfrzgL/bvv+aXZ8QDpJacRy9H0ofwRauQ3Og9wmh6XPgWWag0ECVxjIpRqcg4iCtmtW37i6KSqewNUHkpOO0z2fftWCFG3KofQk7rxWDVlCKm8COiFGMcBbnB+AxIMCo5QGBYA0ACRdAZaC4lCQdHVVWWAGAoiTlAKJv1kric+UX2W3S8gBRAgXBdhGsBxAAdtQislJMMaAhRgk15MXKcG3espjBSBLcwbER0Esjbrsln+bAgMYBHkpnKQIkjAt2M0+PGsPkog+nVR8NczBebQ8ABZCBnb4pxwDmjKAIYvoquQ7m4WTND+AlJ6+IlowSNGbfZ2+0hld4h7cl4H/pjpaXnk3RXl3P4OHxr/eGFbeagOgAyK4uFlmIaYA7zECtU2R105HqvkRrWXpMc39lL1AgvObUyi02ORnCPM0Zad3h+JQMJyAqKA/MbDcEPLeXnUwVi42n1imbasPareWFxlE+M3wR/5bw1mUvLN7F7EwokD4Zxzp7I0X34iWYIcBghTkGKIQoIBWvw5XX2NAn1jK75IQHgJMf/8EXAx2ESEAkh08FGCFGYCgzksgxDkGPkaw9Jx0CRCJMGUA4ZwV72EqrxPkISYvKKDAHVh9cCluH4y4RW4JI4JvHTSL6OofAONXRZaxUK9Lt0t5ylKUknMSuNkoGGSbMs/VeenDdYGiICA91bUCfAaddjndDdRBp20ppYtcMlYeFkkNwdr5vNwGZ2ViA1/+oUO95cK/evhvk+O/nEh9WIRvl25iGoATT1H6y1VM9X0+/akAmG6jPKVlFgRbmEfQJ7gAMMfgmhxxcHKNpzfWvzud/qjozsCY6JqiW1dnntmKrbyr0K8bvMEfyvFt21GLylTP+edUz12PxF26iItcTTHNdk95vvuf//rP/wb32kQfWC/ltG2d4vOyYCqGM+goZfa6rJx8GrLrZ7dtKdfHEEMx7bH1fP87uCtA8VqAAtOAS3BxygIcdzKc2+QE3L+dCnBXAs5PgwO4u78Ydvf7i1SMwhTcn2VXKvmGoiQ4v4GgMEkD8Gn/N/jMmZR/4PmPRZQD51yHGAGYlrcKOI6mu3M5+ZV327/nBXbPFSEm5NwF/tIT7I13llWLw5sUZFGGy+itFOkmR/j7Dz6VH0EPs3flBQy61cpAN6223lFeBt3n+9+hEnhuXJzc8qlWE5qtqtioVy//1ghkuGC1BDPIBZDB2lUWFwW/L3W0iwInJT5lgaQwwdWKao/Hb93q89395+83sF+4+883xny5K8VN84gykG7OhlO8u5F7uvM7E7NTJb0Uo+t2Gaf3n9+p/lI9iTQvKHxgqFauv8pLLjDj3kTdvxPz27jtCzjnocIvAXq7dZYCo6+fwTDwKioYzt/7xSltlzSVD0Fzitl3vX9Z8rjzEreFZIPBv5fxwmEaZGlE2TmSP//aVPHlwnKREgUl/V+Zsb6Av4D1K+BycFc1T3wmyyO6ugM/nwG5HadeLra+XMap6rpIaeXK/muUd3+jMPAXcLqkPAHc8m81oPK9ke/ynzuA4+CGpb8lX+vijKQHUM7Lp+JwHm2Ks59dNksvu44voNM+tUPRMkKQ4WrFhwVu1gEXAA788Y9/BPefPzwJfwE/g/vPt5Psl5sZ6JfUxPhwmjDe6fr/8uvvvE38VVc+A3l6iHjvuV837r5PeXbLN1C/Re/MwMX4cELwg2CUs/+j4OvV3MTFN6f57bn4qTkoq8N3HL2sLpvshqTyI7Am3cn7mYFiHJR5GKV0i/OyHkWnzrKrm6AssTnYlb3uDgMCNxSF1QqC7BQUdzdIX8aEL7fol1Xqyx34+edbE35DEF/L+Sa74AoKnG8jhC/4TnOclf30x8eQnwqQ4yRl+CPbKfaLFMW4HLx+oY27SjuLuLyc/ekjrE+PDzz/DZgc90PlfwMAAP//ORGkuwMgAAA=" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 7 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ latest_version          = 7 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ6XLjOH7/rqp5B8Tj1OxWhxIPSba866kVJVInKYmnqE3KBYKQSBEEaRI6e/tF8iVf83h5hBR1uGV3z+yRrUqNv7QI/C/88D/RnZQyTBlnHTL8BJINYVEGc1ZLoj0O/gD8dEMDmB+e77SBpsgTW++2De+uUn5xDs6LKKVPQKjyP1R+qHDcLdEPlavsblRkaRGxEy1kDKIwwZT9ASwjgilM8PNdRCNWRcvV3VcuK4e0WOKcUyhKg4iunsCDH7EbgpPJDO9ZDZF0E3Aopcto9UNFixL8jXE/3tJUKpsC58VTBQAOlBY8AYxErlysAABAUYQvcMPCNI+OOHiJ8eFEW/5x4K4oQi4vIGi3221Z0o+wIxyQqJSf3fasLbfb7U571tmvl+pgQHrLDm1FiPQPiZsrcm7ZIhk3WWz2LAFnD0FnetwJa6/p0nBGpnMtw9M80vf6nPQekTtp1Qw1kwP+2FJ3+uFTvFyFreXmoHv11uCTBpuTg+XIq0aop+p+acx7jajPUM2cEeorajTKzLhOoiytzxZMZsmq/bqKzXazewwPK7+5aWitaG8N9nVXXm9Mje/NZ0d9neHlIXI3n4qB8SkU7XwWj9ryZjPwZn6+Jp/U0EngeJtvD9ZE3BQTtqWevA796e4weRDd6Rpmo6DWCi34OlWEnXpo2qpI56g+Xe34VTTzm0Xkq9bxQbfw3pUas9bjazabuJo3QtlqkRMT9vujhamF7Dh50IJFPhmr9jw1hTZuH+qrkCE9n8gW8RvmdvogHY/8q2yoIupM6hN+lzV2u9dpuN2JlPlSZo2nLMBs+Mlp8LMpzej8YJp0kYlHdYewKPjzffOBhi1Cw3G+WK3xA0pndNpW9zVEpKZiDg+raDNF8u5TLDx6G+Jpc/sVyizeDcexse5ma2su4oY2FJpp96EY9lG95jbiw3K8DbTCCYNXoTPv9xxnkh3Tlc+3Go4X8cZczejCqAnYWXVqxifXOTBv6T3y+dKZoKCdir3Fkg4bR8+w58NhS1vEkO73kvJgT6JYGeqtwl6LPH9sdg4HfrAcvFr+UJAby4dlIEFk5ON6F3l2oA5qgnzQ3aYqrB/QImr3JsOR7h/nKm9JbPm457Ewe34GCVyn+Z9yHISQVVGa3L33dxyIjYbQOvl85+zzZNEdCLqlNMq1wVQW1iqpZ03VkqN932ruJnFz/kjXtcUDTqf6TKlp/G5Uf2yMQOpvAhi9U1bZ5RHDL2VGuIRlBln4BGosyc7h/VLmiJctzIuTZeicBZ7AXy6GTkzZHoy7L52Jpg2s50cJweUjz+OG2BDrfl2oLx+WDX/ZgJgPJNQSRPTYElrihbsz0aYTUzGu7A/LBpaaQdCqPwoNfglR3eelptREzUBq+f5DE4v4UQiWH5W3XzqKYT2PTZ6NTaFj2MHQiuSu4Qxt014MZ7xqG6c9nnViYWjahuIoenfmLuYLXpVMeygveOLYXX2mid5Rd+SeHTcEX1zwONEaVjcWjV5o+6IhB7xhuHY29oVsCPuLtRWrhmHvRjOiygG/eDUcR5/FpD+zVMewVSng95HGN7KFGhRIyLr6fLH2XV0ye+HaioXX2TyYOorTtBxjgW1BcSx9Dnv6xJpncrDLyr36u71YnVvO0Ah4h7q24dqOqhiKygeJdjDXauhIYW71+AZ2suaM12WbJ5KhqgszZls3JmmQ6JPOyeZhx7ZVZSEGqq2oyonWbXXL71ms6jMq566jeqaja94xHLtuptsOoZjKxsTWZU0YjrUkGBhdee/N1WOwXo08Z7h2Yk3UidZYxOHesO09tPeOqzxKWndo4LVzhGKWalK2t/qkb69DySbedizqQ80d7NFadrCTWR6/h5qAJMfJDrNdyutdI/Gk9GjNSd1X9aYjOAtbkOksJmPYC+RJX2WIZKbmthLPNQ6475hWhx39eKGYLqtrEsq9ozpaOM5GS/RCU4OsQxze7Q77hrDoGiTQLVHdLmIjd1Wna1BnbPaDke0GPatvHE1Fh66rJwEJXFPNoB7X6wEf7DSiQtcaNLxjKPhz+VVz2iNbWRSuotUXPRVaihC6KokMS9bNueFqij4wqSwZPNl5lGx8h9h+hx0N6oh+19g6PeGA++kWz8MmUgzRiYUpitWhP8vqvlhIiDjM6Tux0XNUWxh2LDGQNZsJni2YTt8Jzbls+Mdh7EuL/ejY3huJd5zZ9YNj63LAO/LMVSeOIvSMeTCwHaJ0yMLUlFZnRohqxKm0sBaeJsW7Ra9VILM18sgi82KSBaKxsYV2rsdCZ6IEsuY4sTkPDNcWOp6t9sx1QHSyOmJLjn1xN/oFXvnKa8wDdRa1JNte6DNb6Mxcr/79uNq/+ehslckGzURdJMTkUcNXszGKBwfLFSBU1L2pEA27+9CSiIssJBlH0rGcoW1QfedSm9f6A8kQDMnjjTRIVoJh61tTVaNOss8DS/Z0u+UteEN0+3oH9Vo9sz8UNYVNTXdv6YIz0ubeTu8VW5MQ6vZR7vcy2+lr28k82/nr0HSSPUN9e2vwwtSy7JHtDvt2h03g2oHo6CQGv5hDpS5Z1kCwXeZMusOR3w+JGauFPQ8HM3HftXtO3Y513bPUhj5vS06vQSddeWySgMeOPJvMMt4WA31G25LuOObCfeR1267bSnYwafsI+2Srq8P6xBkahsgO2NVNcx4kszgUoRTqZrLYIFGTXLMl6i4RjHXIsCI0O2ud9+K0MeKzhmGrgtlP914cCMjWvZGkjmzHsINOy/CP3iGIg7lnxw1bWIw9otU9J9Rmx+FEp+oausM9Wtv1xdpQzHg2MqleWOajhPp6A63VrT43eC8ebnQSC7O51upE55xs2A1loOiqTYyhEZPuzDHUcy7nRx8rRX9iWs8RZTinkFQLBlcRXZXVLEsLnFfTwt9EJKim+eojZ7vbNRTTfBb4qsRXhceqIFxI3IkxUowX0xy/jBTPfGkb+jPM6RPcFU8FRjlmRQIpXOH8aVNwGBaME55akvTQEIXWQ6vVulA9+TnenfpW7kG1MSYX+aYtmx1jMLUGE/1Fa+vt3qXktfXuP66s2PgFyqOs7PC5CwuH0iSBNODimUfS1lW/Z1qKdoJOb2vKy9RQ1MH8+QIed0WT26V5fOnFb3DrDoznGmaodsGWu4J9la50DMUy3w6m6N3pZKBbL7Yxfg4Zy4qnWm2bIczxgSAJjbrENxv1li+ggGsd9/nDsbGtvj959e3k1ZKxChN4TCncFeVF124ble/Z9c1ClaUJ+X7/8uc4XUf/cfmAhKQ7HLwEaQIjWoBn8GdwxzBMbt3q7t/AXbjxq+Vdf1w/A/jtFrhqQBA8g7vvW40gh3JWzXDZmF2sOwv8u+37p9nxAekkpRHL0feh/BFo5TY4D3ubHJaOCZZpDgYJXGEgl2pwDiIK2q5ZfePqpqh4AldHSU46Tvd8+lULUrQpB9eTuPNaNWQJqbwJ6IQYxQBvcX4AEg8KjFIaFADSAJB0BVgKikNB0tVVZYEZCCBOUgok/matJD5TfpXdLiEHECFcFGAbwXJIBWxDKSYnwRgDFmKQXE9epATf6imPFYAszRkQHwWxNOqyW/5tCgxgEOSlcJIiSMK0YDf78Kw9SCL6dFLx1TAH59HyAFgIGdjhn3IMaMoAhiyiq5LvbBZO0vwAUnr6imjBIEVv9nX6Smd0SQ7gvswOb6qj5ZV3U5R39zN4aPzrjWHlrTYAOiCCi5tlFmIK8B4jUNsUee10pJof0VqWHtPcT9kLJDi/OYVCi01+hjBPU3Z6mygOBcMJiAr6EwPLDSHv7VUHY+Vi84ll2rb6oHZreZFBhN8Mf+S/NZxFyTu7dxELIwqEf8aRzt548Y1oCXYYIEhBjiEKAQpo9esA9jUG9Iml/C4J4SHA9PdPwMVgFxECINnBQwFWmAEI6rwEQpxj4GMES89JlwCRCFMGEM5Z8R6m8jpBHmLyggIK3IHVB5cC+MGIW+SWMCL41kGziK7+ATB+VWQZC/W6dLuUpyxFKTkngZuNgkG2KfNcnZc+XBcoCgLSU/ErwGfQaZcT4EAddNqWUrrIJWPlYZHUEKydz8ttcFYmNvDlHzrUWy78q4f/Njn+y4nUh0X4dukmpgE48RSlv1zFVN/n058KgOk2ylNaZkGwhXkEfYILAHMMrskRByfXeHpj/bvT6Y+K7gyMia4punV15pmt2Mq7Mv66wZuP5fi2N6lFZarn/HOq565H4i6txkWupphmu6c83/3Pf/3nf4N7baIPrJdyIrdO8XlZMBXDGXSUMntdVk4+Ddn1s9u2lOuDiaGY9th6vv8d3BWgeC1AgWnAJbg4ZQGOOxnObXIC7t9OBbgrAeenwQHc3V8Mu/v9RSpGYQruz7IrlXxDURKc30lQmKQB+LT/G3zmTMo/8PzHIsqBc65DjABMy1sFHEfT3bmc/Mrb7t/zSrvnihATcm4Vf+mZ9sY7y6rF4U0KsijDZfRWinSTI/z9R6HKj6CH2bvyAgbdamWgm1Zb7ygvg+7z/e9QCTw3Lk5u+VSrCc1WVWzUq5d/awQyXLBaghnkAshg7SqLi4LflzraRYGTEp+yQFKY4GpFtcfjt5b2+e7+8/e73C/c/ecbY77cleKmeUQZSDdnwyne3cg93fmdidmpkl6K0XW7jNP7z+9Uf6meRJoXFD4wVCvXX+UlF5hxb6Lu34n5bdz2BZzz5OGXAL3dOkuB0dfPYBh4FRUM5+/94pS2S5rKh6A5xey7AaAsedx5idtCssHg38t44TANsjSi7BzJn39t9PhyYblIiYKS/q8MYl/AX8D6FXA5uKuaJz6T5RFd3YGfz4DczlwvF1tfLjNXdV2ktHJl/zXKu79RGPgLOF1SngBu+bcaUPneXHj5DyDAcXDD0t+Sr3VxRtIDKIfqU3E4jzbF2c8um6WXXccX0Gmf2qFoGSHIcLXiwwI364ALAAf++Mc/gvvPH56Nv4Cfwf3n23H3y80M9EtqYnw4TRjvdP1/+fV3HjD+qiufgTy9Vrz33K8bd9+nPLvlG6jfondm4GJ8OCH4QTDK2f9R8PVqbuLim9P89lz81ByU1eE7jl5Wl012Q1L5EViT7uT9zEAxDso8jFK6xXlZj6JTZ9nVTVCW2Bzsyl53hwGBG4rCagVBdgqKuxukL2PCl1v0yyr15Q78/POtCb8hiK/lfJNdcAUFzrcRwhd8pznOyn7642PITwXIcZIy/JHtFPtFimJcDl6/0MZdpZ1FXJ7X/vQR1qfHB57/BkyO+6HyvwEAAP//us6ReicgAAA=" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210201103406806200000002" -> (known after apply)
      ~ id                                  = "sfr-f88d8983-0018-4222-923a-bf6a1726d56d" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "7" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210201103316260800000001" -> (known after apply)
      ~ id                                  = "sfr-bfbe1993-77ed-4a7d-a60e-6ee2ba32da70" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "7" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-2938156035" -> (known after apply)
      ~ instance_id = "i-058038b85675d1cd3" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-1005946728" -> (known after apply)
      ~ instance_id = "i-03a9bf86f1172bd06" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 12 to add, 4 to change, 10 to destroy.
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*